Autodesk.Revit.DB.Structure.StructuralSettings.GetStructuralSettings(Autodesk.Revit.DB.Document)
Obtains the StructuralSettings object for the specified project document.
doc:
A project document.
Returns:
The StructuralSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolUserDefined
The id of the FamilySymbol to represent a user-defined boundary condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolRoller
The id of the FamilySymbol to represent a roller boundary condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolPinned
The id of the FamilySymbol to represent a pinned boundary condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolFixed
The id of the FamilySymbol to represent a fixed boundary condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.KickerBraceSymbol
The id of the ElementType to represent a kicker brace.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BraceBelowSymbol
The id of the ElementType to represent a brace below a beam in plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BraceAboveSymbol
The id of the ElementType to represent a brace above a beam in plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011